Title: IBM GET_DEPENDENCY procedure - United States

Text:
 TECHNOTE (TROUBLESHOOTING)

PROBLEM(ABSTRACT)
 The GET_DEPENDENCY procedure provides the capability to list all objects that are dependent upon the given object.

You may use this procedure to find object’s dependency, don’t need to check the related catalog table step by step. The following example shows you how to use GET_DEPENDENCY procedure to find dependency on table example easily when renaming table failed with SQL0750N


SYMPTOM
Syntax[/support/docview.wss?uid=swg22015088&amp;aid=1][/support/docview.wss?uid=swg22015088&aid=2] [https://www.ibm.com/support/knowledgecenter/SSEPGG_10.5.0/com.ibm.db2.luw.apdv.sqlpl.doc/doc/r0055165.html?view=kc] 

>>-DBMS_UTILITY.GET_DEPENDENCY--(--type--,--schema--,--name--)->< 

Examples 

db2v105> db2 "create table example(a int)"
DB20000I The SQL command completed successfully.
db2v105> db2 "create table example1 as (select * from example) data initially deferred refresh deferred"
DB20000I The SQL command completed successfully.

db2v105> db2 "rename example to reexample"
DB21034E The command was processed as an SQL statement because it was not a
valid Command Line Processor command. During SQL processing it returned:
SQL0750N The statement failed because the table or column cannot be renamed.
SQLSTATE=42986

db2v105> db2 SET SERVEROUTPUT ON
DB20000I The SET SERVEROUTPUT command completed successfully.

db2v105> db2 "CALL DBMS_UTILITY.GET_DEPENDENCY('TABLE', 'db2v105','example')"

Return Status = 0

DEPENDENCIES ON DB2V105.EXAMPLE
------------------------------------------------------------------
*TABLE DB2V105.EXAMPLE()
* TABLE DB2V105 . EXAMPLE1()


https://www.ibm.com/support/knowledgecenter/SSEPGG_10.5.0/com.ibm.db2.luw.apdv.sqlpl.doc/doc/r0055165.html [https://www.ibm.com/support/knowledgecenter/SSEPGG_10.5.0/com.ibm.db2.luw.apdv.sqlpl.doc/doc/r0055165.html]